snlkuharlocal/src/Reports/ФормулыРасчета/ФормулыРасчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ФормулыРасчета</name>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитОтбора</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ТЗРезультат</name>
    <type>
      <types>ValueTable</types>
    </type>
  </attributes>
  <attributes>
    <name>ДеревоОбщихНастроек</name>
    <type>
      <types>ValueTree</types>
    </type>
  </attributes>
  <attributes>
    <name>ДеревоНастроекПользователя</name>
    <type>
      <types>ValueTree</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата1</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Report>

snlkuharlocal/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>НДС18</name>
    <comment>(Общ) Ставка НДС 18%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <comment>(Общ) Ставка НДС 10%</comment>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <comment>(Общ) Ставка НДС 0%</comment>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
    <comment>(Общ) Ставка НДС 20%</comment>
  </enumValues>
  <enumValues>
    <name>НДС5</name>
    <comment>Новый НДС</comment>
  </enumValues>
  <enumValues>
    <name>НДС7</name>
    <comment>Новый НДС</comment>
  </enumValues>
  <enumValues>
    <name>НДС22</name>
    <comment>(Общ) Ставка НДС 22%</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Reports/ФормулыРасчета/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Результат = ПолучитьТаблицуВнешнегоНабораДанных(Документ, "Товары");
	
	ВнешниеНаборыДанных = Новый Структура;	
	ВнешниеНаборыДанных.Вставить("Данные", Результат);
	
	ДанныеРасшифровки	= Неопределено;	
	КомпоновщикМакета	= Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки		= КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,КомпоновщикНастроек.Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	#Если Клиент Тогда
	ВывестиРезультатВТабличныйДокумент(ПроцессорКомпоновки, ДокументРезультат);
	#КонецЕсли
	
	ТЗРезультат = ПолучитьТЗИзКомпоновки();
	
КонецПроцедуры

Функция ПолучитьТаблицуВнешнегоНабораДанных(Документ, ТабличнаяЧасть = "Товары") Экспорт
	
	ИмяДокумента = Документ.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Если ЗначениеЗаполнено(РеквизитОтбора) Тогда
		Запрос.УстановитьПараметр("РеквизитОтбора", РеквизитОтбора);
	КонецЕсли;
	
	РеквизитОтбораТекст = "";
	Если ТипЗнч(РеквизитОтбора) = Тип("СправочникСсылка.ТипыЦен") Тогда
		РеквизитОтбораТекст = "И ЕСТЬNULL(ТабличнаяЧасть.ТипЦен, ЗНАЧЕНИЕ(Справочник.ТипыЦен.ПустаяСсылка)) = &РеквизитОтбора";
	ИначеЕсли ТипЗнч(РеквизитОтбора) = Тип("СправочникСсылка.Номенклатура") Тогда
		РеквизитОтбораТекст = "И Номенклатура = &РеквизитОтбора";
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТабличнаяЧасть.Ссылка КАК Документ,
	|	ТабличнаяЧасть.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ТабличнаяЧасть.Номенклатура.СтавкаНДС, ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)) КАК НДССтавка,
	|	ЕСТЬNULL(ТабличнаяЧасть.ТипЦен, ЗНАЧЕНИЕ(Справочник.ТипыЦен.ПустаяСсылка)) КАК ТипЦен,
	|	ЕСТЬNULL(ТабличнаяЧасть.Ссылка.БазовыйТипЦен, ЗНАЧЕНИЕ(Справочник.ТипыЦен.ПустаяСсылка)) КАК БазовыйТипЦен,
	|	ЕСТЬNULL(ТабличнаяЧасть.Цена, 0) КАК Цена,
	|	ЕСТЬNULL(ТабличнаяЧасть.БазоваяЦена, 0) КАК БазоваяЦена,
	|	1 КАК Количество
	|ИЗ
	|	Документ." + ИмяДокумента + "." + ТабличнаяЧасть + " КАК ТабличнаяЧасть
	|ГДЕ
	|	ТабличнаяЧасть.Ссылка = &Документ
	|	" + РеквизитОтбораТекст + "
	|";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Таблица.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("Число"));
	
	Для Каждого Стр ИЗ Таблица Цикл
		Стр.СтавкаНДС = ПроцентНДСпоСтавке(Стр.НДССтавка);	
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Функция ПолучитьТЗИзКомпоновки() Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Результат = ПолучитьТаблицуВнешнегоНабораДанных(Документ, "Товары");
	
	ВнешниеНаборыДанных = Новый Структура;	
	ВнешниеНаборыДанных.Вставить("Данные", Результат);
	
	ДанныеРасшифровки	= Неопределено;	
	КомпоновщикМакета	= Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, ДанныеРасшифровки, , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных; 
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ДанныеТЗ = Новый ТаблицаЗначений;
	
	ПроцессорВывода.УстановитьОбъект(ДанныеТЗ);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Возврат ДанныеТЗ;
	
КонецФункции

////////////////////////////// ФУНКЦИЯ ИЗ ЭКСЕЛЯ ///////////////////////////////
// ФУНКЦИЯ ОКРУГЛЕНИЯ "ОКРУГЛТ" (как в EXCEL)
// y = x * Цел(ч/x)
//Функция ОКРУГЛТ(Знач Результат, Знач Показатель) Экспорт
//	Возврат ?(Показатель <> 0, Показатель * Цел(Результат/Показатель), 0);
//КонецФункции
